---
kind: other
id: Methods.T:Autodesk.Revit.DB.ClassificationEntries
source: html/8e9d9b79-d046-5bb0-e6d7-f7124212cc1a.htm
---
# ClassificationEntries Methods

Finds the KeyBasedTreeEntry associated with the given key value.